{
    "_name_or_path": "/mnt/bn/vl-research-boli01-cn/workspace/zzz/projects/zzz/llava_next/project_checkpoints/llavanext-openai_clip-vit-large-patch14-336-meta-llama_Meta-Llama-3-8B-Instruct-blip558k_pretrain_plain_unmask_special_tokens",
    "architectures": [
        "LlavaLlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "eos_token_id": 128001,
    "pad_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "image_aspect_ratio": "anyres_max_4",
    "image_crop_resolution": 224,
    "image_grid_pinpoints": [
        [
            336,
            672
        ],
        [
            672,
            336
        ],
        [
            672,
            672
        ],
        [
            1008,
            336
        ],
        [
            336,
            1008
        ]
    ],
    "image_split_resolution": 224,
    "image_token_index": 128256,
    "initializer_range": 0.02,
    "intermediate_size": 14336,
    "max_position_embeddings": 8192,
    "mm_hidden_size": 1024,
    "mm_patch_merge_type": "spatial_unpad",
    "mm_projector_lr": null,
    "mm_projector_type": "mlp2x_gelu",
    "mm_resampler_type": null,
    "mm_tunable_parts": "mm_vision_tower,mm_mlp_adapter,mm_language_model",
    "mm_use_im_patch_token": false,
    "mm_use_im_start_end": false,
    "mm_vision_select_feature": "patch",
    "mm_vision_reduction_scale": 0,
    "min_single_token_dup_num": 1,
    "toxic_codebook_flag": false,
    "toxic_codebook_path": "/DATA2/yangdingchen/coco/results/241202-122538-results/coco_train_100samples_numPrototypes-969.pt",
    "toxic_codebook_thres": 0.11,
    "random_patch_num": 0,
    "pad_token_emb_flag": false,
    "pad_token_emb_path": "/DATA3/yangdingchen/checkpoint/llama3-llava-next-8b-embds/llama3-llava-next-8B-pad_token_ids_0_word_token_embedding.pt",
    "mm_vision_select_layer": -2,
    "mm_vision_tower": "/home/lufan/Projects/smallcap/pretrained/openai/clip-vit-large-patch14-336",
    "mm_vision_tower_lr": 2e-06,
    "model_type": "llava_llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 500000.0,
    "tie_word_embeddings": false,
    "tokenizer_model_max_length": 8192,
    "tokenizer_padding_side": "right",
    "torch_dtype": "float16",
    "transformers_version": "4.39.3",
    "use_cache": true,
    "use_mm_proj": true,
    "vision_tower_pretrained": null,
    "vocab_size": 128256
}